//  문제 내용
/*
    꿍은 도비에게 영어단어들을 제시한 후 어떤 단어가 대소문자를 구분하지 않고 사전순으로 가장 앞서는지 맞추면 양말을 주어 자유를 얻게해준다고 하였다.

    하지만 인성이 좋지 않은 꿍은 사실 그러고 싶지 않았기 때문에 대소문자를 마구 섞어가며 단어들을 제시했다. 
    예를 들어, apPle은 Bat보다 앞서지만 AnT보다는 뒤에 있는 단어다.

    도비에게 희망은 여러분뿐이다! 여러분이 도비에게 자유를 선물해주도록 하자!
*/

//  문제 분석
/*
    - 테스트케이스 정수 : n (단어의 개수)
    - 대소문자를 구분하지 않고, 사전순으로 가장 앞에 있는 단어 출력
    - n개의 만큼 문자열 입력
    - 0을 입력하면 종료
*/

//  문제 조건

/*
    입력
    - 각 테스트케이스는 정수 n (2 ≤ n ≤ 1000) 으로 시작하며 주어지는 단어의 개수를 뜻한다.
    - 다음 각 n줄은 길이가 최대 20인 단어가 주어지며 대소문자의 구분을 없앴을 때 똑같은 단어는 주어지지 않는다.
    - 마지막 입력은 0이 주어진다.

    출력
    - 각 줄에 각 테스트케이스에서 사전상 가장 앞서는 단어를 출력한다.
*/

//  예제 입력 및 출력
/*
    입력1
    3
    Cat
    fat
    bAt
    4
    call
    ball
    All
    Hall
    0

    출력1
    bAt
    All
*/


// 파일 시스템 모듈 불러오기
const fs = require('fs');

// 입력값을 한 줄씩 배열로 저장
const input = fs.readFileSync('/dev/stdin').toString().trim().split("\n");

// 무한 반복문 시작
while (true){
    // 1. 단어의 개수 입력받기
    const num = Number(input.shift());
    // 2. 0이 입력되면 반복문 종료
    if (num === 0) {
        break;
    }

    // 3. 단어들을 저장할 배열 생성
    const wordList = []
    // 4. 입력받은 개수만큼 단어 입력받아 배열에 저장
    for (let i = 0; i < num; i++) {
        wordList.push(input.shift());
    }

    // 5. 대소문자 구분 없이 사전순 정렬
    wordList.sort((a, b) => a.toLowerCase().localeCompare(b.toLowerCase()));
    // 6. 가장 앞서는 단어 출력
    console.log(wordList[0]);
}

